v2206/MSc_icedAirfoil/Meshing_ice_1_v2/+15deg/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    airfoil
    {
	type            zeroGradient;
    }
    west
    {
        type            zeroGradient;
    }
    east
    {
        type            fixedValue;
        value           $internalField;
    }
    north
    {
        type            zeroGradient;
    }
    south
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}
// ************************************************************************* //
